{
  "architectures": [
    "InternLMForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "modeling_internlm.InternLMConfig",
    "AutoModelForCausalLM": "modeling_internlm.InternLMForCausalLM",
    "AutoModel": "modeling_internlm.InternLMForCausalLM"
  },
  "bias": true,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 2816,
  "max_position_embeddings": 2048,
  "model_type": "internlm",
  "num_attention_heads": 8,
  "num_hidden_layers": 22,
  "rms_norm_eps": 1e-06,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.30.2",
  "use_cache": true,
  "vocab_size": 8192
}
